app/controllers/races_controller.rb

  def show
    @race = Race.find(params[:id])
---
SELECT * FROM `races` WHERE (`races`.`id` = 953125641)